/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fngoc <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/30 12:03:59 by fngoc             #+#    #+#             */
/*   Updated: 2020/10/30 12:04:04 by fngoc            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ft_isalnum: возвращает ненулевое значение,
** если его аргумент является либо буквой
** ал­фавита (верхнего или нижнего регистра),
** либо цифрой. Если символ не является
** буквенно-циф­ровым, возвращается 0.
*/

int	ft_isalnum(int c)
{
	return (((c >= 48) && (c <= 57)) ||
			((c >= 65) && (c <= 90)) ||
			((c >= 97) && (c <= 122))) ? 1 : 0;
}
