/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isascii.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fngoc <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/30 12:05:18 by fngoc             #+#    #+#             */
/*   Updated: 2020/10/30 12:05:24 by fngoc            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ft_isascii: возвращает ненулевое значение,
** если значение ch находится в пределах
** от 0 до 0x7F, в противном случае возвращается 0.
*/

int	ft_isascii(int c)
{
	return (((c >= 0) && (c <= 0x7F)) ? 1 : 0);
}
