/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstlast.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fngoc <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/03 16:54:41 by fngoc             #+#    #+#             */
/*   Updated: 2020/11/03 16:54:43 by fngoc            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ft_lstlast: Возвращает последний элемент списка.
*/

t_list	*ft_lstlast(t_list *lst)
{
	t_list *p;
	t_list *l;

	p = lst;
	l = p;
	while (p != NULL)
	{
		l = p;
		p = p->next;
	}
	return (l);
}
