/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fngoc <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/28 11:21:26 by fngoc             #+#    #+#             */
/*   Updated: 2020/10/28 11:23:07 by fngoc            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ft_memchr: Функция memchr ищет вхождение в массив
** cимвола, код которого задан аргументом c, сравнивая
** каждый байт массива определенный как unsigned char
** с кодом искомого символа. Если искомый символ найден,
** то возвращается адрес найденного символа и сравнение
** завершается. Если, после проверки n байтов,
** искомый символ не найден, то сравнение прекращается
** и функция возвращает NULL.
*/

void	*ft_memchr(const void *arr, int c, size_t n)
{
	const char	*tmp;

	tmp = arr;
	while (n-- != 0)
	{
		if (*tmp != c)
			tmp++;
		else
			return ((char *)tmp);
	}
	return (NULL);
}
