/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strmapi.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fngoc <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/31 15:43:34 by fngoc             #+#    #+#             */
/*   Updated: 2020/10/31 15:43:38 by fngoc            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ft_strmapi: Применяет функцию 'f' к каждому
** символу string 's' для создания новой
** строки в результате последовательного применения 'f'.
*/

char	*ft_strmapi(char const *s, char (*f)(unsigned int, char))
{
	char	*p;
	size_t	i;

	p = NULL;
	i = 0;
	if (s && f && (p = (char *)malloc(sizeof(char) * (ft_strlen(s) + 1))))
	{
		while (s[i])
		{
			p[i] = f(i, s[i]);
			++i;
		}
		p[i] = '\0';
	}
	return (p);
}
