/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_toupper.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fngoc <marvin@42.fr>                       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/10/30 12:06:58 by fngoc             #+#    #+#             */
/*   Updated: 2020/10/30 12:07:02 by fngoc            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
** ft_toupper: возвращает соответствующий верхнему
** регистру эквивалент символа c, если c — это буква.
*/

int	ft_toupper(int c)
{
	return ((c >= 97 && c <= 122) ? (c - 32) : c);
}
