/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   error.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fngoc <fngoc@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/01/18 11:23:42 by fngoc             #+#    #+#             */
/*   Updated: 2021/01/18 11:23:59 by fngoc            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "cub3d.h"

/*
** error: печатает текст ошибки и выходит из программы.
*/

void	error(char *str, t_cub *cub)
{
	ft_putendl_fd(str, 1);
	free(&cub);
	exit(0);
}
